app/controllers/Api/V1/locations_controller.rb

            def create
                location = Location.new(location_params)
                    if location.save
---
INSERT INTO "locations" ("name", "description", "Trip_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asd"], ["description", "asd"], ["Trip_id", 1], ["created_at", "2021-02-28 23:24:21.813423"], ["updated_at", "2021-02-28 23:24:21.813423"]]

            def destroy
                location = Location.find(params[:id])
                    if location.destroy
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 5]]