app/controllers/Api/V1/trips_controller.rb

SELECT "trips".* FROM "trips"
---
            def index
                trips = Trip.all

SELECT "trips".* FROM "trips" WHERE "trips"."slug" = ? LIMIT ?  [["slug", "enchanting-europe"], ["LIMIT", 1]]
---
            def show
                trip = Trip.find_by(slug: params[:slug])

INSERT INTO "trips" ("name", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "this is a trip"], ["slug", "this-is-a-trip"], ["created_at", "2021-02-27 20:20:04.644623"], ["updated_at", "2021-02-27 20:20:04.644623"]]
---
            def create
                trip = Trip.new(trip_params)

                if trip.save

SELECT "trips".* FROM "trips" WHERE "trips"."slug" = ? LIMIT ?  [["slug", "my-trip"], ["LIMIT", 1]]
UPDATE "trips" SET "name" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["name", "my fun trip"], ["updated_at", "2021-02-27 20:24:10.958612"], ["id", 4]]
---
            def update
                trip = Trip.find_by(slug: params[:slug])

                if trip.update(trip_params)

SELECT "trips".* FROM "trips" WHERE "trips"."slug" = ? LIMIT ?  [["slug", "my-trip"], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 4]]
---
            def destroy
                trip = Trip.find_by(slug: params[:slug])

                if trip.destroy